{"data":{"markdownRemark":{"html":"<p>With 2018 coming to an end soon I was able to release V2 of my website over Thanksgiving holiday. Coincidentally this is also my second year as a developer so I'll be able to keep these releases in sync with my years of experience. What’s new? Everything! V2 was completely redesigned from the ground up with a little design inspiration from <a href=\"https://www.taniarascia.com/%22\" target=\"_target\" rel=\"nofollow\">Tania Rascia</a>. I switched from using create-react-app to Gatsby. The reason for this switch was to keep my blog on Github via Markdown files and also take advantage of Gatsby blazing fast speed with SSR. As you can see from the results below I was able to increase each area on the lighthouse test.</p>\n<p><img src=\"https://res.cloudinary.com/smithmanny/image/upload/c_scale,f_auto,h_500,q_auto:best/v1542907305/old-site-performance_uws4hm.png\" alt=\"&#x22;Old site performance&#x22;\">\n<img src=\"https://res.cloudinary.com/smithmanny/image/upload/c_scale,f_auto,h_500,q_auto:best/v1542907305/new-site-performance_d2ixpo.png\" alt=\"&#x22;New site performance&#x22;\"></p>\n<p>With this version release of my website, I wanted to switch the focus from learning more about me to more about programming by putting the blog posts front and center. With this change, people would immediately be focused on my new blog posts and are able to learn something new within the first few seconds of visiting my website. </p>\n<p>Another slight change I made was the color scheme. I still am not completely satisfied with my color scheme, but I wanted to go for a Miami Dolphins theme. I originally planned on releasing this site with the option of choosing between a light and dark theme, but because of a bug with styled-components and Gatsby, I postponed this feature until further notice. Curious as to what else I used to build this site? Well let’s see:</p>\n<ul>\n<li>Gatsby</li>\n<li>Hosting &#x26; DNS: Netlify</li>\n<li>CSS: styled-components</li>\n<li>Analytics: Google Analytics (looking for free alternatives 🤔)</li>\n<li>Blog: Markdown files hosted on Github </li>\n<li>Icons: Font Awesome</li>\n</ul>\n<p>You can check out the code <a href=\"https://github.com/smithmanny/Portfolio\" target=\"_target\" rel=\"nofollow\">\"here\"</a></p>","frontmatter":{"title":"Website Redesign V2"}}},"pageContext":{"slug":"website-redesign-v2"}}