{"data":{"markdownRemark":{"html":"<p><img src=\"https://shakhorblog.files.wordpress.com/2018/03/browser.png?quality=80&#x26;strip=info&#x26;w=800\"></p>\n<blockquote>\n<p><em>I invested $100 and changed my life for the best.</em></p>\n</blockquote>\n<p>Just like the title says I was able to land my first web developer position in only 4 months of studying. Well to be honest maybe a little more than 4 months. It all started back in my junior year of high school. I took my first computer class which was \"HTML/CSS Introduction\". This was back in 2010 so I'm not sure if responsive design was already out, but I do know that we didn't learn it. This class was just going over the basics of web development, we never built anything \"amazing\" just some plain simple websites with a little of styling. I loved the class, but unfortunately, I stopped programming after I completed the class.</p>\n<p><img src=\"https://i0.wp.com/media.giphy.com/media/AjYsTtVxEEBPO/giphy.gif?ssl=1\"></p>\n<p>Fast forward to 2016 I was working at Publix warehouse as an order selector. Life was good, I was making decent money and had full benefits (This was my first serious job). Until they announced that they were relocating to Alabama. I didn't see myself retiring as a warehouse worker anyway, so I let my managers know that I wouldn't be relocating with them. We had until the end of December before the location transfer. Well fortunately for me I left in November and signed up Team Treehouse. It was actually awkward because when I left my job, I just randomly seen an ad for Front-End Web Development, so I signed up for the free 7-day trial.</p>\n<p>After completing my 7-day trial, I was hooked on web development again. So upgraded from the trial to the actual program. It was like I had an addiction, I couldn't stop learning. Every day I was spending 3+ hours studying. Sometimes I would stay up all night completing courses, go to sleep for a few hours, wake up and do it all again.</p>\n<p><img src=\"https://i1.wp.com/media.giphy.com/media/4LL66XsL0aTZe/giphy.gif?ssl=1\"></p>\n<p>So from November 2016 to February 2017, I was able to complete Team Treehouse Front-End Developer Stack. Once I completed it, I felt confident enough to start working on some projects and my portfolio. I wish that I still have my first portfolio design to remind myself how far I came, but I didn't know git at the time <img src=\"https://twemoji.maxcdn.com/2/72x72/1f926-1f3fe.png\" alt=\"🤦🏾\">‍. It wasn't nothing special though, it was a basic portfolio page built with HTML5, CSS3, Bootstrap, and a single line of jQuery. And to be honest I was proud af for my accomplishment that I started applying for jobs. After sending multiple applications to companies through indeed, luckily I was able to land an interview for a small company.</p>\n<p><img src=\"https://i1.wp.com/media.giphy.com/media/11sBLVxNs7v6WA/giphy.gif?ssl=1\"></p>\n<p>I still remember the day I got a call back for my first developer interview. I couldn't believe it. Just three months ago I was a warehouse worker trying to figure out what I'm going to do with my life. Walking into the interview I was nervous. I couldn't stop sweating, I started getting chills through my body, and I was sweating so much I felt like I starting smelling. I finally sat down with the manager of the office and we start the conversation about me. She wanted to get to know me better and what I knew and didn't know. So I was honest with her, I mean she already knew because she viewed my resume. After telling her I was self-taught and just started, she ended up telling me more about the company and what my role would be. When we got through talking she introduced me to the IT manager and the CEO...did I just get the job?</p>\n<p>Well, come to find out the already had their mind set on hiring me because of my portfolio. They knew that I had just started and wanted someone that knew PHP, but because of my determination and how quickly I learned that offered me the position on the spot!</p>\n<p>So my advice to new developers out there who feel lost and think they are wasting their time, you're not. Keep on studying and perfecting your craft, build some projects, set up a portfolio, and network. Just don't give up because it will all be worth it in the end</p>","frontmatter":{"title":"How I Became A Web Developer In 4 Months","slug":"how-i-became-a-web-developer-in-4-months"}}},"pageContext":{"slug":"how-i-became-a-web-developer-in-4-months"}}